[ReflexStock_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Reflex Stock"
FriendlyNamePlural="Reflex Stocks"
BriefSummary="Missed shots with this weapon have a 25% chance to become a graze."
TinySummary="25% to turn a miss into a graze."
LootTooltip="This weapon upgrade, when installed, adds a 25% chance to turn a missed shot into a graze."

[ReflexStock_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Reflex Stock"
FriendlyNamePlural="Advanced Reflex Stocks"
BriefSummary="Missed shots with this weapon have a 30% chance to become a graze."
TinySummary="30% to turn a miss into a graze."
LootTooltip="This weapon upgrade, when installed, adds a 30% chance to turn a missed shot into a graze."

[ReflexStock_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Reflex Stock"
FriendlyNamePlural="Superior Reflex Stocks"
BriefSummary="Missed shots with this weapon have a 35% chance to become a graze."
TinySummary="35% to turn a miss into a graze."
LootTooltip="This weapon upgrade, when installed, adds a 35% chance to turn a missed shot into a graze."